function Labolatorka_assn

%         ИСХОДНЫЕ ДАННЫЕ
Umax = 5; %амплитуда радио импульса (В)
f0 = 13 * 10^6;  %частота высокочастотного 
             %заполнения радиоимпульса (Гц)
tm = 0.000001;   %время импульса (с)
a = 0.12;        %понижающий коофициент
z0 = 30;         %пороговое значение 
N = [2.04592, -0.29242, 0.39201, -1.17043, 0.2499, 1.14811, -0.36295, -0.91796, 0.15753, 0.94774,...
0.71412, 0.15169, 1.9558, -0.38884, -1.34212, -0.66207, -0.38332, -1.05995, 0.3671,...
-0.4809, -1.36455, 0.45916, -0.59882, -0.29473, -0.9768, 0.3802, -0.65022, 0.33195, -0.23413, 0.1234];
%вектор значений помех
J = 10;          %потери энергии сигнала (%)

%             РЕШЕНИЕ
w = 2*pi * f0;   %радиальная частота априорного сигнала 
dt = 1 / (2*(f0+2/tm));   %временной промежуток дискретизации
z = 0;
M = fix(2*f0*tm + 2) + 1 + 1;
%                      отрисовка идеальных сигналов:
%испускаемого
to = 0:tm/10000:tm;
Xo = Umax*cos(w * to);   

%пришедшего
Yo = a*Xo;

for i=1:M
    t(i)=dt*(i-1);
    X(i)= Umax*cos(w * t(i));
    Y(i)= a*X(i) + N(i);
    z=z+X(i)*Y(i);
end;
X
Y
plot(t,X,'o',to,Xo);
plot(t,Y,'o--',to,Yo);
z
%       импульсная хар-ка 
t_im = 10;
N = 9;
t = 0:t_im/(N-1):t_im;
U_input = [2, 2.4, 2.6, 2.4, 2, 1.6, 1.4, 1.6, 2]; 
for i=1:N
   T(1, i, 1) = t(i);
   T(2, i, 1) = t(i);
   U(1, i, 1) = 0; 
   U(2, i, 1) = U_input(N - i + 1); 
end
plot(T(:,1,1), U(:,1,1),'r_-',...
    T(:,2,1), U(:,2,1),'r_-',...
    T(:,3,1), U(:,3,1),'r_-',...
    T(:,4,1), U(:,4,1),'r_-',...
    T(:,5,1), U(:,5,1),'r_-',...
    T(:,6,1), U(:,6,1),'r_-',...
    T(:,7,1), U(:,7,1),'r_-',...
    T(:,8,1), U(:,8,1),'r_-',...
    T(:,9,1), U(:,9,1),'r_-', -1,0, t_im + 1,0);

for i=1:N
   for j=1:N
    T(1, j, i+1) = t(j) + t_im/(N-1) * (i-1);
    T(2, j, i+1) = t(j) + t_im/(N-1) * (i-1);
    U(1, j, i+1) = 0; 
    U(2, j, i+1) = U_input(j) * U(2, i, 1);    
   end
   
end

i=10;
plot(T(:,1,i), U(:,1,i),'r_-',...
    T(:,2,i), U(:,2,i),'r_-',...
    T(:,3,i), U(:,3,i),'r_-',...
    T(:,4,i), U(:,4,i),'r_-',...
    T(:,5,i), U(:,5,i),'r_-',...
    T(:,6,i), U(:,6,i),'r_-',...
    T(:,7,i), U(:,7,i),'r_-',...
    T(:,8,i), U(:,8,i),'r_-',...
    T(:,9,i), U(:,9,i),'r_-', i-3,0, t_im + (i-0+1),0);

for i=1:(2*N - 1)
    T(1, i, N+2) = t_im/(N-1) * (i-1);
    T(2, i, N+2) = t_im/(N-1) * (i-1);
    U(1, i, N+2) = 0; 
    
    U(2, i, N+2) = 0;
   if i<=N
       for j=1:i 
       
       U(2, i, N+2) = U(2, i, N+2) + U(2, i-j+1, j+1);
       
       end
   else
       U(2, i, N+2) =  U(2, N - (i-N), N+2)
   end
   
end

i=N+2;
plot(T(:,1,i), U(:,1,i),'r_-',...
    T(:,2,i), U(:,2,i),'r_-',...
    T(:,3,i), U(:,3,i),'r_-',...
    T(:,4,i), U(:,4,i),'r_-',...
    T(:,5,i), U(:,5,i),'r_-',...
    T(:,6,i), U(:,6,i),'r_-',...
    T(:,7,i), U(:,7,i),'r_-',...
    T(:,8,i), U(:,8,i),'r_-',...
    T(:,9,i), U(:,9,i),'k_-',...
    T(:,10,i), U(:,10,i),'r_-',...
    T(:,11,i), U(:,11,i),'r_-',...
    T(:,12,i), U(:,12,i),'r_-',...
    T(:,13,i), U(:,13,i),'r_-',...
    T(:,14,i), U(:,14,i),'r_-',...
    T(:,15,i), U(:,15,i),'r_-',...
    T(:,16,i), U(:,16,i),'r_-',...
    T(:,17,i), U(:,17,i),'r_-',...
i-12,0, t_im + (i-0+1),0);

end